In [2]:
#Crete a panda series from a python list [10,20,30,40,50] with custom indexes ['a','b','c','d','e']
#a. Print the first 3 elements
#b. Access the element at index c

import pandas as pd

x = pd.Series([10,20,30,40,50],index=['a','b','c','d','e'])
print(x[0:3])
print(x['c'])

a    10
b    20
c    30
dtype: int64
30

In [10]:
#Create Dataframe with duplicate rows:
#a. Identify the duplicates and display only the duplicate row.
#b. drop duplicates while
# keeping the last occurence
#removing all duplicates
import pandas as pd
d={
    'Name':['Om','Guru','Raj','Sourav','Raj','Chinmaya','Om'],
    'Age':[20,21,22,22,22,23,20],
    'City':['Jsr','Cut','Ang','Bala','Ang','Pur','Jsr'],
}

df = pd.DataFrame(d)
df[df.duplicated()]

  Name  Age City
4  Raj   22  Ang
6   Om   20  Jsr

In [9]:
df_last = df.drop_duplicates(keep='last')
df_last

       Name  Age  City
1      Guru   21   Cut
3    Sourav   22  Bala
4       Raj   22   Ang
5  Chinmaya   23   Pur
6        Om   20   Jsr

In [8]:
df_none = df.drop_duplicates(keep=False)
df_none

       Name  Age  City
1      Guru   21   Cut
3    Sourav   22  Bala
5  Chinmaya   23   Pur

In [14]:
#Q3
import pandas as pd
data = {
    'Department':['HR','IT','HR','IT','Finance'],
    'Employee':['A','B','C','D','E'],
    'Salary':[40000,50000,42000,55000,60000]
}
df = pd.DataFrame(data)
df

  Department Employee  Salary
0         HR        A   40000
1         IT        B   50000
2         HR        C   42000
3         IT        D   55000
4    Finance        E   60000

In [23]:
#a
df1 = df
df1['Salary'].mean()

49400.0

In [ ]:
#b

In [17]:
#c
df_s1 =df
df_s1.sort_values(by='Salary',ascending=True)

  Department Employee  Salary
0         HR        A   40000
2         HR        C   42000
1         IT        B   50000
3         IT        D   55000
4    Finance        E   60000

In [16]:
#d
df_s2 = df
df_s2.sort_values(by='Department',ascending=False)
df_s2.sort_values(by='Salary',ascending=False)

  Department Employee  Salary
4    Finance        E   60000
3         IT        D   55000
1         IT        B   50000
2         HR        C   42000
0         HR        A   40000